app/controllers/awards_controller.rb

SELECT * FROM `awards` WHERE (`awards`.`id` = 2) LIMIT 1
---
  def index
    @awards = Award.find(:all)

SELECT * FROM `awards` WHERE (`awards`.`id` = 2)
---
  def show
    @award = Award.find(params[:id])

SELECT * FROM `awards` WHERE (`awards`.`id` = 2)
---
  def edit
    @award = Award.find(params[:id])

INSERT INTO `awards` (`name`, `created_at`, `updated_at`, `description`) VALUES('Actress in a Leading Role', '2010-02-07 06:34:07', '2010-02-07 06:34:07', '')
---
  def create
    @award = Award.new(params[:award])

    respond_to do |format|
      if @award.save

SELECT * FROM `awards` WHERE (`awards`.`id` = 2)
UPDATE `awards` SET `description` = 'The award for the best movie of the year.\r\n', `updated_at` = '2010-01-16 04:00:49' WHERE `id` = 1
---
  def update
    @award = Award.find(params[:id])

    respond_to do |format|
      if @award.update_attributes(params[:award])