app/controllers/leagues_controller.rb

  def index
    @leagues = User.find(current_user.id).leagues
---
SELECT * FROM `users` WHERE (`users`.`id` = 24) ORDER BY score DESC LIMIT 1
SELECT `leagues`.id FROM `leagues` INNER JOIN `memberships` ON `leagues`.id = `memberships`.league_id WHERE (`leagues`.`id` = 8) AND ((`memberships`.user_id = 4)) LIMIT 1

  def show
    @league = League.find(params[:id])
---
SELECT * FROM `leagues` WHERE (`leagues`.`id` = 15)

  def create
    # automatically create a passcode
    @user = User.find(current_user.id)
    @league = League.new(params[:league]) # TODO: pretty sure this is not secure. fix it.

    respond_to do |format|
      if @league.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
INSERT INTO `leagues` (`name`, `updated_at`, `description`, `passcode`, `created_at`) VALUES('Giant Marmelade', '2010-01-18 07:16:38', '', 'porcupine', '2010-01-18 07:16:38')

  def join
    @user = User.find(current_user.id)
    @league = League.find_by_passcode(params[:passcode])

    respond_to do |format|
      if @league
        if @user.leagues.exists?(@league.id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
SELECT * FROM `leagues` WHERE (`leagues`.`passcode` = '34536') LIMIT 1
SELECT * FROM `users` LIMIT 1
SELECT `leagues`.id FROM `leagues` INNER JOIN `memberships` ON `leagues`.id = `memberships`.league_id WHERE (`leagues`.`id` = 2) AND ((`memberships`.user_id = 24)) LIMIT 1

  def standings
    @league = League.find(params[:id])
---
SELECT * FROM `leagues` WHERE (`leagues`.`id` = 15)

  def destroy
    @user = User.find(current_user.id)
    @league = League.find(params[:id])
    @user.leagues.delete(@league)

    @league.destroy unless @league.users.count > 1
---
SELECT * FROM `users` WHERE (`users`.`id` = 24) ORDER BY score DESC LIMIT 1
SELECT * FROM `leagues` WHERE (`leagues`.`id` = 1)
DELETE FROM `leagues` WHERE `id` = 1
SELECT count(*) AS count_all FROM `users` INNER JOIN `memberships` ON `users`.id = `memberships`.user_id WHERE ((`memberships`.league_id = 1))