app/controllers/nominees_controller.rb

SELECT * FROM `awards` WHERE (`awards`.`id` IS NULL) LIMIT 1
SELECT `nominees`.* FROM `nominees` INNER JOIN `nominations` ON nominations.nominee_id = nominees.id INNER JOIN `awards` ON `awards`.id = `nominations`.award_id WHERE (`nominations`.`award_id` = 3)
---
  def index
    if (params[:award_id])
      @nominees = Award.find_by_id(params[:award_id]).nominees

SELECT * FROM `nominees` WHERE (`nominees`.`id` = 3)
---
  def show
    @nominee = Nominee.find(params[:id])

SELECT * FROM `nominees` WHERE (`nominees`.`id` = 3)
---
  def edit
    @nominee = Nominee.find(params[:id])

INSERT INTO `nominees` (`name`, `created_at`, `updated_at`, `movie_name`, `last_name`, `description`, `first_name`) VALUES('A Matter of Loaf and Death', '2010-02-07 07:53:40', '2010-02-07 07:53:40', 'A Matter of Loaf and Death', '', '', '')
---
  def create
    @nominee = Nominee.new(params[:nominee])

    respond_to do |format|
      if @nominee.save

SELECT * FROM `nominees` WHERE (`nominees`.`id` = 3)
---
  def update
    @nominee = Nominee.find(params[:id])