app/controllers/nominations_controller.rb

SELECT * FROM `nominations` WHERE (`nominations`.`id` = 2) LIMIT 1
---
  def index
    @nominations = Nomination.find(:all)

SELECT * FROM `nominations` WHERE (`nominations`.`id` = 6)
---
  def show
    @nomination = Nomination.find(params[:id])

INSERT INTO `nominations` (`created_at`, `nominee_id`, `updated_at`, `award_id`) VALUES('2010-02-07 09:09:35', 14, '2010-02-07 09:09:35', 1)
---
  def create
    @nomination = Nomination.new(params[:nomination])

    respond_to do |format|
      if @nomination.save

SELECT * FROM `nominations` WHERE (`nominations`.`id` = 7)
UPDATE `nominations` SET `updated_at` = '2010-02-07 09:12:07', `nominee_id` = 25 WHERE `id` = 7
---
  def update
    @nomination = Nomination.find(params[:id])

    respond_to do |format|
      if @nomination.update_attributes(params[:nomination])