app/controllers/users_controller.rb

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = 'f3c21f456f85520f6cd9586eef17124bb6eb1d95') LIMIT 1